Revit 2026 API

# SlabShapeEditorPickSupport Method

---

Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void PickSupport(
	Line gLine
)
```
```vb
Public Sub PickSupport (
	gLine As Line
)
```
```cpp
public:
void PickSupport(
	Line^ gLine
)
```
```fsharp
member PickSupport :
        gLine : Line -> unit
```

#### Parameters

gLine Line
    A line from a support element such as a beam.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input line is . |
| ArgumentException | Thrown when the input line is invalid. |

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace